app/Controllers/Register.php

	public function index()
	{
		helper(['form']);

		$model = new UserModel();
		$user = $model->where("email", $this->request->getVar('email'))->first();
		if (!$user) {
			$rules = [
				'email' => 'required',
				'password' => 'required|min_length[6]',
				'full_name' => 'required',
				'address' => 'required',
				'phone' => 'required'
			];
			if (!$this->validate($rules)) return $this->fail($this->validator->getErrors());

			$dataUser = [
				'email' => $this->request->getVar('email'),
				'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
				'role' => $this->request->getVar('role'),
				'is_member' => $this->request->getVar('is_member'),
				'is_verified' => $this->request->getVar('is_verified')
			];
			$modelUser = new UserModel();
			$registered1 = $modelUser->save($dataUser);
---
INSERT INTO `users` (`email`, `password`) VALUES ('syahidan139@gmail.com', '$2y$10$bWCUNh03emE58L/tZYL3NeyiGD7mfAf/eCOnKYCy8yWW.6NeZWieO')